In [6]:
import pandas as pd

# Load data
df = pd.read_csv("../data/raw/sec_financials.csv")

In [7]:

# Basic cleaning
df.dropna(inplace=True)

In [8]:

# Convert numeric columns
cols = ["Revenue", "NetIncome", "Assets", "Liabilities", "CashFlow"]
df[cols] = df[cols].astype(float)

In [9]:

# Save processed data
df.to_csv("../data/processed/cleaned_financials.csv", index=False)

In [10]:

df.head()

  Company  Year    Revenue  NetIncome     Assets  Liabilities  CashFlow
0   Apple  2000  142371.05   33172.24  384019.84    145163.08  29125.13
1   Apple  2000  120078.27   32006.15  324479.10    212221.10  25934.33
2   Apple  2000  142850.44   36871.22  274941.13    107477.92  32878.15
3   Apple  2000  126225.89   22870.76  298384.13    132964.32  25293.37
4   Apple  2000  122111.43   15024.12  272641.07    143964.03  17917.59

In [11]:
df

     Company  Year    Revenue  NetIncome      Assets  Liabilities   CashFlow
0      Apple  2000  142371.05   33172.24   384019.84    145163.08   29125.13
1      Apple  2000  120078.27   32006.15   324479.10    212221.10   25934.33
2      Apple  2000  142850.44   36871.22   274941.13    107477.92   32878.15
3      Apple  2000  126225.89   22870.76   298384.13    132964.32   25293.37
4      Apple  2000  122111.43   15024.12   272641.07    143964.03   17917.59
...      ...   ...        ...        ...         ...          ...        ...
4995  Oracle  2024  433241.96  100481.93   990919.97    717236.68  126620.20
4996  Oracle  2024  410740.07   42609.40  1368415.19    540167.95   35119.16
4997  Oracle  2024  394473.26   91415.86  1320123.78    816685.10  116639.26
4998  Oracle  2024  376206.94   24524.34  1018912.81    797867.99   25783.93
4999  Oracle  2024  373032.84   39282.10   742180.84    348029.80   32282.09

[5000 rows x 7 columns]